kenvinh/ch554_sdcc/examples/usb_device_hid/main.c
/*******************************************************************************
* Function Name  : USBDeviceInit()
* Description    : Configure USB mode ，USB device init configure.Configure tie Endpoint, compound device, 
				           Endpoint 0 control trans, Endpoint 1/2 interrupt(IN).
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USBDeviceInit()
{
	  IE_USB = 0;
	  USB_CTRL = 0x00;                                                           // Device mode
	
    UEP1_DMA = (uint16_t)Ep1Buffer;                                                      // Endpoint 1 uploard address
    UEP0_DMA = (uint16_t)Ep0Buffer;                                                      // Endpoint 0 trans address
    UEP2_DMA = (uint16_t)Ep2Buffer;                                                      // Endpoint 2 uploard address	
    UEP4_1_MOD = UEP4_1_MOD | bUEP1_TX_EN & ~(bUEP1_RX_EN | bUEP1_BUF_MOD | bUEP4_RX_EN | bUEP4_TX_EN); // Endpoint 1 sigle 64 byte send buffer, Endpoint 4 disable
    UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;                                 // Endpoint 1 auto Toggle flag, In translation return NAK
    UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;                                 // Endpoint 0 OUT trans return ACK, IN trans return NAK    

    UEP2_3_MOD = UEP2_3_MOD | bUEP2_TX_EN | bUEP2_RX_EN & ~bUEP2_BUF_MOD;      // Endpoint 2 sigle 64 byte send buffer OUT[64]+IN[64] (OUT first)
    UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;                                 // Endpoint 2 auto Toggle flag, IN trans return NAK
		
	  USB_DEV_AD = 0x00;                                                         // Initial the device address
	  UDEV_CTRL = bUD_PD_DIS;                                                    // Disable DM/PM PULL_DOWN.
	  USB_CTRL = bUC_DEV_PU_EN | bUC_INT_BUSY | bUC_DMA_EN;                      // Enable inter PULL_UP. Auto return NAK, during interrupt routing, if the interrupt flag.
	  UDEV_CTRL |= bUD_PORT_EN;                                                  // Enable USB port.
	  USB_INT_FG = 0xFF;                                                         // Clear interrupt flag.
	  USB_INT_EN = bUIE_SUSPEND | bUIE_TRANSFER | bUIE_BUS_RST;                  // Enable USB interrupt
	  IE_USB = 1;                                                                // Enable USB interrupt
}

/*******************************************************************************
* Function Name  : Enp1IntIn()
* Description    : USB Device mode Endpoint 1 upload data, Interrupt mode
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
static void Enp1IntIn( void )
{			
    memcpy( Ep1Buffer, HIDKey, sizeof(HIDKey));                              			// Upload data
    UEP1_T_LEN = sizeof(HIDKey);                                             			// Upload length
    UEP1_CTRL = UEP1_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK;                			// Return ACK
    while(( UEP1_CTRL & MASK_UEP_T_RES ) == UEP_T_RES_ACK);                  			// Waiting upload complete, avoid overwriting	
}
/*******************************************************************************
* Function Name  : Enp2IntIn()
* Description    : USB Device mode Endpoint 2 upload data, Interrupt mode 
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
static void Enp2IntIn( void )
{	
    memcpy( &Ep2Buffer[64], HIDCom, sizeof(HIDCom) );                         			// Upload data
    UEP2_T_LEN = sizeof(HIDCom);                                           				// Upload length
    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK;                			// Return ACK
    while(( UEP2_CTRL & MASK_UEP_T_RES ) == UEP_T_RES_ACK);                  			// Waiting upload complete, avoid overwriting	
}			

/*******************************************************************************
* Function Name  : DeviceInterrupt()
* Description    : CH554USB ISR
*******************************************************************************/
void DeviceInterrupt( void ) __interrupt (INT_NO_USB) __using (1)
{
    uint8_t len;			
	
    if(UIF_TRANSFER)                                                           			//USB trans flag
    {	
		switch (USB_INT_ST & (MASK_UIS_TOKEN | MASK_UIS_ENDP) )			
        {			
        case UIS_TOKEN_IN | 2:                                                 			// Endpoint 2 upload
			UEP2_T_LEN = 0;                                                     		// Reset length
            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_NAK;           		// Default return NAK
            break;                                                                         
		 case UIS_TOKEN_OUT | 2:                                                 		// Eendpoint 2 download 
            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_T_RES_NAK;           		// Default return NAK
            break;	                                                                       
        case UIS_TOKEN_IN | 1:                                                  		// Endpoint 1 upload
			UEP1_T_LEN = 0;                                                     		// Reset length
            UEP1_CTRL = UEP1_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_NAK;           		// Default return NAK
            FLAG = 1;                                                           		// Upload complete flag
            break;		                                                                   
        case UIS_TOKEN_SETUP | 0:                                               		// SETUP packet
            len = USB_RX_LEN;
            if( len == (sizeof(USB_SETUP_REQ)) )
            {
                SetupLen = UsbSetupBuf->wLengthL;
                if(UsbSetupBuf->wLengthH || SetupLen > 0x7F )
                {
                    SetupLen = 0x7F;    												// Total length less than 0X7F
                }
                len = 0;                                                         		// Default length is 0
                if( (UsbSetupBuf->bRequestType & USB_REQ_TYP_MASK) != USB_REQ_TYP_STANDARD )
                {
					if( (UsbSetupBuf->bRequestType == 0x21)&&(UsbSetupBuf->bRequest == HID_SET_REPORT) )
					{			
						EnumOK = 1;														// Class require, SET REPORT, indicate the enumerate complete							
#if DE_PRINTF
	printf( "Init ok \r\n" );
#endif						
					}
					if( (UsbSetupBuf->bRequestType == 0x21)&&(UsbSetupBuf->bRequest == HID_SET_IDLE) )
					{					
						UEP0_T_LEN = 0;                                                 //Status stage complete, upload 0 data packet, end the control trans
	//					UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_STALL | UEP_T_RES_STALL;
					}
                    len = 0;                                                  		// Fail
                }
				else{
																						// Deal with the standard require
					SetupReq = UsbSetupBuf->bRequest;
					switch( SetupReq )                                                  // Require code
					{
					case USB_GET_DESCRIPTOR:
						switch( UsbSetupBuf->wValueH )
						{
						case 1:                                                       	// Device descriptor					
							pDescr = DevDesc;                                         	// Write device descriptor to buffer
							len = sizeof( DevDesc );	
							break;	
						case 2:                                                       	// Configuration descriptor					
							pDescr = CfgDesc;                                         	// Write configuration descriptor to buffer
							len = sizeof( CfgDesc );	
							break;	
						case 0x22:                                                    	// HID report descriptor						
							if( UsbSetupBuf->wIndexL == 0 )                           	// Interface index 0 HID report --> keyboard
							{						
								pDescr = KeyRepDesc;                                  	// Write to buffer
								len = sizeof( KeyRepDesc );	
							}	
							else 	
								if( UsbSetupBuf->wIndexL == 1 )                       	// Interface index 1 HID report --> Composite device
								{								
									pDescr = ComRepDesc;                              	// Write to buffer
									len = sizeof( ComRepDesc );
								}
								else
								{
									len = 0xff;                                         // Add interface index, if required
								}
//							if( UsbSetupBuf->wIndexL == 0 )                       	// Interface index 1 HID report --> Composite device
//							{								
//								pDescr = ComRepDesc;                              	// Write to buffer
//								len = sizeof( ComRepDesc );
//							}
//							else
//							{
//								len = 0xff;                                         // Add interface index, if required
//							}
								break;
						default:
							len = 0xff;                                               	// Length equal 0 if code error
							break;	
						}	
						if ( len == 0xff ){	
							break;                                                    	// Error code, jump out the swith sentence
						}											
						if ( SetupLen > len ){	
							SetupLen = len;                                           	// Limit the total length 
						}	
						len = SetupLen >= 8 ? 8 : SetupLen;                           	// Upload this length
						memcpy( Ep0Buffer, pDescr, len );                             	// Upload data
						SetupLen -= len;	
						pDescr += len;	
						break;	
							
					case USB_SET_ADDRESS:	
						SetupLen = UsbSetupBuf->wValueL;                              	// Save the device address					
						break;
					case USB_GET_CONFIGURATION:
		
						Ep0Buffer[0] = UsbConfig;
						if ( SetupLen >= 1 )
						{
							len = 1;
						}					
						break;
					case USB_SET_CONFIGURATION:
			
