kenvinh/ch554_sdcc/examples/usb_device_hid/main.c
						UsbConfig = UsbSetupBuf->wValueL;				
						break;
					case 0x0A:
						break;
					case USB_CLEAR_FEATURE:                                            	//Clear Feature
			
						if ( (UsbSetupBuf->bRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP ) 
						{
						   switch( UsbSetupBuf->wIndexL )
						   {
							  case 0x82:
								   UEP2_CTRL = UEP2_CTRL & ~ (bUEP_T_TOG | MASK_UEP_T_RES) | UEP_T_RES_NAK;
								   break;
							  case 0x81:
								   UEP1_CTRL = UEP1_CTRL & ~ (bUEP_T_TOG | MASK_UEP_T_RES) | UEP_T_RES_NAK;
								   break;
							  case 0x01:
								   UEP1_CTRL = UEP1_CTRL & ~ (bUEP_R_TOG | MASK_UEP_R_RES) | UEP_R_RES_ACK;
								   break;
							  default:
								   len = 0xFF;                                         	// Error endpoint
								   break;
							}
						 }
						else
						{
							len = 0xFF;                                                	// Deal with the error endpoint
						}
						break;
					case USB_SET_FEATURE:                                          		// Set Feature 					
						if( (UsbSetupBuf->bRequestType & 0x1F) == 0x00 )               
						{
							if( ( ((uint16_t)UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL ) == 0x01 )
							{
								if( CfgDesc[ 7 ] & 0x20 )
								{
									 /* Awake the device */
								}
								else
								{
									len = 0xFF;                                        	// Error routing
								}
							}
							else
							{
								len = 0xFF;                                            	// Error routing
							}
						}
						else 
							if( (UsbSetupBuf->bRequestType & 0x1F) == 0x02 )            // Set endpoint
							{
								if( ( ((uint16_t)UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL ) == 0x00 )
								{
									switch( ((uint16_t)UsbSetupBuf->wIndexH << 8) | UsbSetupBuf->wIndexL )
									{
										case 0x82:
											UEP2_CTRL = UEP2_CTRL & (~bUEP_T_TOG) | UEP_T_RES_STALL;/* Endpoint 2 IN STALL */
											break;

										case 0x02:
											UEP2_CTRL = UEP2_CTRL & (~bUEP_R_TOG) | UEP_R_RES_STALL;/* Endpoint 2 OUT STALL */
											break;

										case 0x81:
											UEP1_CTRL = UEP1_CTRL & (~bUEP_T_TOG) | UEP_T_RES_STALL;/* Endpoint 1 IN STALL */
											break;

										default:
											len = 0xFF;                                   	// Error routing
											break;
									}
								}
								else
								{
									len = 0xFF;                                      		// Error routing
								}
							}
							else
							{
								len = 0xFF;                                          		// Error routing
							}
							break;
					case USB_GET_STATUS:													// Get status
						 Ep0Buffer[0] = 0x00;
						 Ep0Buffer[1] = 0x00;
						 if ( SetupLen >= 2 )
						 {
							len = 2;
						 }
						 else
						 {
							len = SetupLen;
						 }
						 break;
					default:
						len = 0xff;                                                    		// Error routing
						break;
					}
				}
            }
            else
            {
                len = 0xff;                                                         		//Packet length error
            }
            if(len == 0xff)
            {
                SetupReq = 0xFF;
 //               UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_STALL | UEP_T_RES_STALL;	// Control endpoint should not return STALL, 
																							// if Send STALL, that means the device has no ability to communicate with the host
            }
            else if(len <= 8)                                                       		// Upload the data or return the 0 data packet
            {		
                UEP0_T_LEN = len;		
                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK;		// Default data packet is DATA1, and return ACK
            }		
            else		
            {		
                UEP0_T_LEN = 0;  															// Upload 0 data packet, incase the host go to status stage ahead, and get fault code
                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK;		// Default data packet is DATA1, and return ACK
            }		
            break;		
        case UIS_TOKEN_IN | 0:                                                      		// Endpoint 0 IN
            switch(SetupReq)
            {
            case USB_GET_DESCRIPTOR:
                len = SetupLen >= 8 ? 8 : SetupLen;                                 		// Current length
                memcpy( Ep0Buffer, pDescr, len );                                   		// Upload the data
                SetupLen -= len;
                pDescr += len;
                UEP0_T_LEN = len;
                UEP0_CTRL ^= bUEP_T_TOG;                                           			//Toggle Sysc flag 
                break;
            case USB_SET_ADDRESS:
                USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | SetupLen;
                UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
                break;
            default:
//                UEP0_T_LEN = 0;                                                     		//Status stage complete, upload 0 data packet, end the control trans
//                UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;		
                break;
            }
			if(len == 0xff)
			{
				UEP0_T_LEN = 0;                                                     		//Status stage complete, upload 0 data packet, end the control trans
                UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;		
			}
            break;
        case UIS_TOKEN_OUT | 0:  															// Endpoint 0 OUT
            len = USB_RX_LEN;
            if( SetupReq == 0x09 )
            {
                if( Ep0Buffer[0] )
                {
#if DE_PRINTF
                    printf("Light on Num Lock LED!\n");
#endif
                }
                else if( Ep0Buffer[0] == 0)
                {
#if DE_PRINTF
                    printf("Light off Num Lock LED!\n");
#endif
                }
            }
            UEP0_T_LEN = 0;  																// Upload 0 data packet, incase the host go to status stage ahead, and get fault code
            UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_ACK;										// Default data packet is DATA1, and return ACK
            break;
        default:
            break;
        }
        UIF_TRANSFER = 0;                                                           		// Reset the trans interrupt
    }
    if( UIF_BUS_RST )                                                                		// Device mode Bus reset
    {
        UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
        UEP1_CTRL = bUEP_AUTO_TOG | UEP_R_RES_ACK;
        UEP2_CTRL = bUEP_AUTO_TOG | UEP_R_RES_ACK | UEP_T_RES_NAK;
        USB_DEV_AD = 0x00;
        UIF_SUSPEND = 0;
        UIF_TRANSFER = 0;
        UIF_BUS_RST = 0;                                                            		// Reset Reset interrupt
    }		
    if( UIF_SUSPEND )                                                               		// USB Suspended and Awake interrupt
    {		
        UIF_SUSPEND = 0;		
        if ( USB_MIS_ST & bUMS_SUSPEND )                                            		// Suspended
        {		
#ifdef DEBUG		
            printf( "Enter LPM\r\n" );                                              		// Enter LPM flag for debug
#endif
            while ( XBUS_AUX & bUART0_TX )
            {
			
                ;    																		// Waiting send complete ...
            }		
            SAFE_MOD = 0x55;		
            SAFE_MOD = 0xAA;		
            WAKE_CTRL = bWAK_BY_USB | bWAK_RXD0_LO;                               			// Action on USB Bus, or RXD0, will awake the device
            PCON |= PD;                                                           			// LPM
            SAFE_MOD = 0x55;		
            SAFE_MOD = 0xAA;		
            WAKE_CTRL = 0x00;		
        }		
    }		
    else {                                                                         			// Unexpected interrupt
        USB_INT_FG = 0xFF;                                                         			// Reset the interrupt
    }
}

