kenvinh/ch554_sdcc/examples/usb_device_hid/main.c
/*******************************************************************************
* Function Name  : static SendKey( char *p)
* Description    : ASCII to key code
* Input          : char *p
* Output         : None
* Return         : None
*******************************************************************************/

static void SendKey ( const char *p )
{

	char c = *p;
		
	if( (c >= 'a') && (c <= 'z' )){
		c = c - 'a' + 'A';
	}
	
	if( (c >= 'A') && (c <= 'Z' )){
		HIDKey[2] = c - 'A' + 4;
	}
	else
		if( c >= '1' && c <= '9' )
			HIDKey[2] = c - '1' + 0X1E;
		else
		{
		switch ( c ){
			case '`' :
				HIDKey[0] = 0X08;
				HIDKey[2] = 0X15;
				break;
			case '\\':
				HIDKey[2] = 0x31;
				break;
			case ' ':
				HIDKey[2] = L_SHIFT;
				break;
			case '\r':
				HIDKey[2] = ENTER;
				break;
			case ':':
				HIDKey[0] = 0x02;
				HIDKey[2] = 0x33;
				break;
			case '+':
				HIDKey[0] = 0x000;
				HIDKey[2] = 0x57;
				break;
			case '_':
				HIDKey[0] = 0X02;
				HIDKey[2] = 0X2D;
				break;
			case '/':
				HIDKey[0] = L_CTL + L_ALT;
				HIDKey[2] = 0X16;
				break;
			case '0':
				HIDKey[2] = 0X27;
				break;
			case '.':
				HIDKey[2] = 0X37;
				break;
			case '~':
				HIDKey[0] = L_ALT;
				HIDKey[2] = 0X05;
				break;
			case '!':
				HIDKey[0] = L_ALT;
				HIDKey[2] = 0X08;
				break;
			default:
				break;
		}
	}
	
	mDelaymS( 20 );																				//emulate the press down and pop up
	while(FLAG == 0);                                           								// Upload the key
	Enp1IntIn();						
	while(FLAG == 0);   																					
	mDelaymS( 20 );
	HIDKey[0] = 0X00;     						
	HIDKey[2] = 0X00;                                              								// Reset the key
	while(FLAG == 0);                                           						
	Enp1IntIn();			
	while(FLAG == 0); 
}

// static long do_rand(unsigned long *ctx)
// {
//   return ((*ctx = *ctx * 1103515245UL + 12345UL) % ((unsigned long)RAND_MAX + 1));
// }

// static unsigned long next = 1;

// long rand(void)
// {
//   return do_rand(&next);
// }
/*******************************************************************************
* Function Name  : static void UploadData(void)
* Description    : Upload the HID code
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
static void UploadData(void)
{
	uint8_t i;
	for( i = 1; i < 64 ;i ++ )
		HIDCom[i] += rand();
}
/*******************************************************************************
* Function Name  : extern HIDValueHandle( void )
* Description    : Upload the HID code
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
extern void HIDValueHandle( void )
{
	static uint8_t rotateFlag = 0;																// When upload keys complete, upload EP2 data
  uint16_t KeyData = TouchKeyButton;
  if(TKEY_CTRL&bTKC_IF)		                                    //query key
  {
     KeyData = TKEY_DAT;                                      //
#ifdef DE_PRINTF
     printf("B.=  %04x\n",KeyData&0x7FFF);		
#endif
  }		
	if (rotateFlag &&(KeyData < (TouchKeyButton-100)))	        //100 灵敏度调节					
  {
		HIDCom[0] += 0x01;	
		UploadData();

		Enp2IntIn();	
	}			
	else if(rotateFlag == 0)
	{				
      SendKey(pStr);																	     	 // Upload path
			pStr++;	
			if(*pStr == '\0')			
			{
				SendKey( "~" );																	     // Upload ALT+B
				mDelaymS( 200 );	
				rotateFlag = 1;
			}		
	}	

}
void main( void )
{
  CfgFsys();                                //Configure sys
	mDelaymS(5);                              //
  mInitSTDIO( );                            // Init UART0

#if	DE_PRINTF
    printf( "Start config.\r\n" );
    printf( "Init USB device.\r\n" );
#endif
	USBDeviceInit();                          // Configure the USB module,the Endpoint and the USB Interrupt
  EA = 1;	
	UEP1_T_LEN = 0;                           // Reset the trans length register
  UEP2_T_LEN = 0;                                                  
  FLAG = 0;
	EnumOK = 0;
//   TouchKeyQueryCylSet1Or2ms(1);	            //set query cycle
//   TouchKeyChanelSelect(3);                  //set query chanel	
    while(1)
	{
       
        if( EnumOK == 1 )
        {					
            HIDValueHandle();				
        }
        else
        {
            if(TKEY_CTRL&bTKC_IF)           //wait query finsh,max 2ms 获取键值基准值，多采样几次
            {							
            TouchKeyButton = TKEY_DAT;      //	
#ifdef DE_PRINTF
            printf("A.=  %04x\n",TouchKeyButton&0x7FFF);		
#endif	
            }							
        }					
    }
}

/**************************** END *************************************/